a1 = -6
d = 3
a2 = a1 + d*(2-1)
a3 = a1 + d*(3-1)
a4 = a1 + d*(4-1)
a5 = a1 + d*(5-1)
a6 = a1 + d*(6-1)
a7 = a1 + d*(7-1)
a8 = a1 + d*(8-1)
a9 = a1 + d*(9-1)
a10 = a1 + d*(10-1)
print('Арифметическая прогрессия\nс разницей 3:\n',a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, sep='  ')


a1 = int(input())
d = int(input())
n = int(input())
r = a1 + d * (n-1)
print(r)


# Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке)
# последовательными членами арифметической прогрессии.
a1 = int(input())
a2 = int(input())
a3 = int(input())
if a2-a1 == a3-a2:
    print('YES')
else:
    print('NO')


a1 = int(input('Введите первое число:\n'))
d = int(input('Введите разность ариф.прогрессии:\n'))
k = int(input('Введите второе число:\n'))

result = ''  # Инициализация переменной с пустым значением

for i in range(k):
    result += str(a1 + i * d) + ' '

print('\nВсе члены прогрессии', result)


